tap "adoptopenjdk/openjdk"
tap "finestructure/hummingbird"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "nektos/tap"
tap "nextdns/tap"
tap "pulumi/tap"
# Run your GitHub Actions locally 🚀
brew "act"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Library for manipulating PNG images
brew "libpng"
# New file format for still image compression
brew "jpeg-xl"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Software library to render fonts
brew "freetype"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Statistics utility to count lines of code
brew "cloc"
# Console Matrix
brew "cmatrix"
# C library implementing the SSH2 protocol
brew "libssh2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Generic library support script
brew "libtool"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Graphics library to dynamically manipulate images
brew "gd"
# GNU multiple precision arithmetic library
brew "gmp"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Network authentication protocol
brew "krb5"
# Postgres C API library
brew "libpq"
# NaCl networking and cryptography library
brew "libsodium"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Regular expressions library
brew "oniguruma"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image processing and image analysis library
brew "leptonica"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Platform built on V8 to build network applications
brew "node", link: false
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Image manipulation library
brew "jpeg", link: true
# Lightweight and flexible command-line JSON processor
brew "jq"
# BSD-style licensed readline alternative
brew "libedit"
# Conversion library
brew "libiconv"
# GNOME XML library
brew "libxml2"
# C XSLT library for GNOME
brew "libxslt"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@16", link: true
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Programmer-oriented testing framework for PHP
brew "phpunit"
# Object-relational database system
brew "postgresql@14"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Cloud native development platform
brew "pulumi"
# Fast, efficient and secure backup program
brew "restic"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: true
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Version control system designed to be a better CVS
brew "subversion"
# Nodejs-based tool for optimizing SVG vector graphics files
brew "svgo"
# Tool Command Language
brew "tcl-tk"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# NextDNS DNS/53 to DoH Proxy
brew "nextdns/tap/nextdns"
# A swiss army knife for Pulumi development
brew "pulumi/tap/pulumictl"
# Desktop password and login vault
cask "bitwarden"
# Virtual Audio Driver
cask "blackhole-2ch"
# E-books management software
cask "calibre"
# Calendar for professionals and teams
cask "cron"
# Server and cloud storage browser
cask "cyberduck"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Collaborative team software
cask "figma"
# Utility for customizing which browser to start
cask "finicky"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-anonymous-pro"
cask "font-hack"
cask "font-inter"
# Typeface made for developers
cask "font-jetbrains-mono"
# Geometric sans-serif multi-purpose font
cask "font-kumbh-sans"
# Expanded by font bureau with a range of 8 weights
cask "font-lexend"
cask "font-montserrat"
cask "font-open-sans"
# Font with a mechanical skeleton and the forms are largely geometric
cask "font-roboto"
cask "font-source-code-pro"
# GIT client
cask "fork"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Tools to protect your emails and files
cask "gpg-suite"
# Tool to optimize images to a smaller size
cask "imageoptim"
# App to manage software development and track bugs
cask "linear-linear"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Team inbox and chat tool
cask "missive"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Markdown files editor
cask "nota"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# Control your tools with a few keystrokes
cask "raycast"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Native GUI tool for relational databases
cask "tableplus"
# Messaging app with a focus on speed and security
cask "telegram"
# Automatic time-tracking application
cask "timemator"
# To-do list
cask "todoist"
# Utility to hide the notch
cask "topnotch"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Betternet VPN", id: 1028905953
mas "ColorSlurp", id: 1287239339
mas "Craft", id: 1487937127
mas "Keynote", id: 409183694
mas "Listy", id: 1496035097
mas "Metronome", id: 1629209970
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
