tap "adoptopenjdk/openjdk"
tap "azure/azd"
tap "azure/functions"
tap "dapr/tap"
tap "finestructure/hummingbird"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "nektos/tap"
tap "nextdns/tap"
tap "oven-sh/bun"
tap "pulumi/tap"
# Run your GitHub Actions locally
brew "act"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Library for manipulating PNG images
brew "libpng"
# Color management engine supporting ICC profiles
brew "little-cms2"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# C library implementing the SSH2 protocol
brew "libssh2"
# Regular expressions library
brew "oniguruma"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Software library to render fonts
brew "freetype"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Statistics utility to count lines of code
brew "cloc"
# Console Matrix
brew "cmatrix"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Generic library support script
brew "libtool"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# GNU multiple precision arithmetic library
brew "gmp"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Network authentication protocol
brew "krb5"
# NaCl networking and cryptography library
brew "libsodium"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# YAML Parser
brew "libyaml"
# Tool that bootstraps your dotfiles
brew "dotbot"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Image processing and image analysis library
brew "leptonica"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Platform built on V8 to build network applications
brew "node"
# Firebase command-line tools
brew "firebase-cli"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie", link: false
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tool Command Language
brew "tcl-tk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# BSD-style licensed readline alternative
brew "libedit"
# Conversion library
brew "libiconv"
# GNOME XML library
brew "libxml2"
# C XSLT library for GNOME
brew "libxslt"
# Rainbows and unicorns in your console!
brew "lolcat"
# Fast Cross-Platform Package Manager
brew "micromamba"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@16"
# Platform built on V8 to build network applications
brew "node@18"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Tool to automatically fix PHP coding standards issues
brew "php-cs-fixer"
# Programmer-oriented testing framework for PHP
brew "phpunit"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Cloud native development platform
brew "pulumi"
# Fast, efficient and secure backup program
brew "restic"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Version control system designed to be a better CVS
brew "subversion"
# Nodejs-based tool for optimizing SVG vector graphics files
brew "svgo"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Azure Developer CLI
brew "azure/azd/azd"
# Azure Functions Core Tools 4.0
brew "azure/functions/azure-functions-core-tools@4"
# Client for Dapr.
brew "dapr/tap/dapr-cli"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# A swiss army knife for Pulumi development
brew "pulumi/tap/pulumictl"
# Professional graphic design software
cask "affinity-designer"
# Professional image editing software
cask "affinity-photo"
# Chromium based browser
cask "arc"
# Desktop password and login vault
cask "bitwarden"
# Virtual Audio Driver
cask "blackhole-2ch"
# E-books management software
cask "calibre"
# Calendar for professionals and teams
cask "cron"
# Server and cloud storage browser
cask "cyberduck"
# Database version management tool
cask "dbngin"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Reimagine your terminal
cask "fig"
# Collaborative team software
cask "figma"
# Utility for customizing which browser to start
cask "finicky"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Programming font
cask "font-anonymous-pro"
cask "font-dm-sans"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Variable font designed for display
cask "font-inter"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Geometric sans-serif multi-purpose font
cask "font-kumbh-sans"
# Expanded by font bureau with a range of 8 weights
cask "font-lexend"
cask "font-montserrat"
cask "font-open-sans"
cask "font-palanquin"
cask "font-poppins"
# Font with a mechanical skeleton and the forms are largely geometric
cask "font-roboto"
# Developer targeted fonts with a high number of glyphs
cask "font-sauce-code-pro-nerd-font"
cask "font-source-sans-3"
cask "font-space-grotesk"
# GIT client
cask "fork"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Tools to protect your emails and files
cask "gpg-suite"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# File system integration
cask "macfuse"
# Team inbox and chat tool
cask "missive"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Open-source music notation software
cask "musescore"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Markdown files editor
cask "nota"
# App to write, plan, collaborate, and get organized
cask "notion"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Preference Pane for controlling PostgreSQL database servers
cask "postgrespreferencepane"
# VPN client focusing on security
cask "protonvpn"
# HTTP debugging proxy
cask "proxyman"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Print driver for printing documents directly to a pdf file
cask "rwts-pdfwriter"
# Instant messaging application focusing on security
cask "signal"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Native GUI tool for relational databases
cask "tableplus"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Automatic time-tracking application
cask "timemator"
# To-do list
cask "todoist"
# Utility to hide the notch
cask "topnotch"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Network protocol analyzer
cask "wireshark"
# Video communication and virtual meeting platform
cask "zoom"
